[
{"url": "http://yamaha.lk/Sitemap.aspx"},
{"url": "http://yamaha.lk/BusinessContact.aspx"},
{"url": "http://yamaha.lk/About.aspx"},
{"url": "http://yamaha.lk/Warranty.aspx"},
{"url": "http://yamaha.lk/Dealer.aspx"},
{"url": "http://yamaha.lk/ServiceDealers.aspx"},
{"url": "http://yamaha.lk/SalesDealer.aspx"},
{"url": "http://yamaha.lk/cygnusAlpha.aspx", "engine": "The air-cooled 113 cc Blue Core engine with a Continuously Variable Transmission provides smooth acceleration and pleasing pickup. The BS24 carburetor with Throttle Positioning Sensors(TPS) and YAMAHA’s Blue Core engine delivers outstanding running performance, excellent fuel efficiency and good emission quality.", "brand": "yamaha", "model": "cygnusAlpha", "color": "Radient Cyan Marvel Black"},
{"url": "http://yamaha.lk/Fascino.aspx", "engine": "Air-cooled, 4 stroke, single cylinder 113cc Blue Core engine effortlessly delivers outstanding economy with smooth acceleration.", "brand": "yamaha", "model": "Fascino", "color": "Sassy Cyan Rouge Red Haute White Cool Cobalt Tuxedo Black Fusion Red Unite White Mingling Cyan"},
{"url": "http://yamaha.lk/Alpha.aspx", "engine": "The air cooled 113 cc engine with a continuously variable transmission provides smooth acceleration and pleasing pickup. The BS24 carburettor with Throttle Positioning and Yamaha’s engine concept idea Blue Core delivers outstanding running performance, excellent fuel efficiency and good emission quality.", "brand": "yamaha", "model": "Alpha", "color": "Rocking Red Beaming Blue  Gleaming Gold Radiant White Magical Magenta Brilliant Black Graceful Grey Fiery Red"},
{"url": "http://yamaha.lk/rayzr_disc.aspx", "engine": "The Ray is Powered with an air-cooled 4-stroke, 2-valve 113cc engine with a Continuously Variable Transmission unit, which provides both smooth initial acceleration and pickup. It also features technologies that reduce horsepower loss like a roller rocker arm, and achieves excellent fuel efficiency and running performance. It is tuned with settings that provide easy-to-use power, especially in the extremely low speed ranges.", "brand": "yamaha", "model": "rayzr_disc", "color": "Armada Blue Dark Night  Rooster Red"},
{"url": "http://yamaha.lk/RayZR.aspx", "engine": "Powered with an air-cooled 4-stroke, 2-valve 113cc engine with a continuously variable transmission unit which provides both smooth initial acceleration and a pleasing feeling of pickup. also features technologies that reduce horsepower loss like a roller rocker arm, and achieves excellent fuel efficiency and running performance. It is tuned with settings that provide easy-to-use power, especially in the extremely low- and low-speed ranges.", "brand": "yamaha", "model": "RayZR", "color": "Maverick Blue Matt Green"},
{"url": "http://yamaha.lk/RayZ.aspx", "engine": "RAY-Z has a powerful 113cc Air-cooled 4-stroke 113cc engine with (Continuous variable transmission) that delivers smooth start-up acceleration and good pickup along with great fuel economy. The engine is based on Yamaha's engine concept ideal \"Blue core\" to gives sporty rides with good fuel mileage.", "brand": "yamaha", "model": "RayZ", "color": "Regal Red Astral Blue Moon Walk White True Blue"},
{"url": "http://yamaha.lk/FZ25.aspx", "engine": "The FZ25 mounts a 249cc air-cooled 4-stroke, single-cylinder, fuel-injected engine. Based on a reliable 250cc single-cylinder engine proven on sport bikes for the Japanese market, the FZ25’s engine has been fine-tuned and optimized for the Indian traffic environment, primarily in the intake/exhaust systems and the ignition system. The 74 x 58 mm bore x stroke, hemispherical combustion chamber and 9.8:1 compression ratio gives this engine its maximum power output at 8,000 rpm and maximum torque at 6,000 rpm. The shapes of the combustion chamber and the intake port have been optimized to boost combustion speed. Furthermore, this engine adopts a lightweight forged Aluminum piston, a plated cylinder with outstanding heat dissipation characteristics, thin piston rings for reduced power loss and more. Also, a balancer is added to reduce vibration perceived by the rider(s).", "brand": "yamaha", "model": "FZ25", "color": "Ballistic Blue Knight Black Warrior White"},
{"url": "http://yamaha.lk/Saluto.aspx", "engine": "Get your hands on the amazing Blue Core Technology with Yamaha Saluto's air-cooled single cylinder engine, that gives super pick up with vibration-free running and above all, an incredible mileage of 78 kmpl* that never says stop.", "brand": "yamaha", "model": "Saluto", "color": ""},
{"url": "http://yamaha.lk/FZ16V2.aspx", "engine": "YAMAHA's Fuel Injection System contains sensors, actuators and an Engine Control Unit Sensors detect temperature, atmospheric pressure and engine condition. Based on this, commands the optimal amount of fuel to the engine. It helps deliver the best engine performance at all speeds by providing fuel calculated at 1/1000 sec based on inlet pressure throttle position engine rotation speed and more. It also ensures high-efficiency combustion by providing the right amount of fuel, depending on riding conditions and contributes to increased mileage and cleaner emissions.", "brand": "yamaha", "model": "FZ16V2", "color": "Scorching Red Panther Black Barrel Red Bomber Black"},
{"url": "http://yamaha.lk/FZSV2.aspx", "engine": "The all new Fuel Injection(FI) Blue Core engine of uses advanced sensors and actuators to calculate and deliver the optimum amount of fuel to the engine enhancing both performance and mileage.", "brand": "yamaha", "model": "FZSV2", "color": "Moon Walk White  Cyber Green Molten Orange  Matt Green Wolf Gray Alligator Green Viper Black Shark White Hurricane Gray Knight Red Lightning Cyan Opal White Dark Knight"},
{"url": "http://yamaha.lk/FazerV2.aspx", "engine": "YAMAHA’s Fuel Injection System contains sensors, actuators and an Engine Control Unit Sensors detect temperature, atmospheric pressure and engine condition. Based on this, commands the optimal amount of fuel to the engine. It helps deliver the best engine performance at all speeds by providing fuel calculated at 1/1000 sec based on inlet pressure throttle position engine rotation speed and more. It also ensures high-efficiency combustion by providing the right amount of fuel, depending on riding conditions and contributes to increased mileage and cleaner emissions.", "brand": "yamaha", "model": "FazerV2", "color": "Volcano Red  Ravine Black Snowstorm White Marble White Midnight Black Burning Red"},
{"url": "http://yamaha.lk/YZFR15V2.aspx", "engine": "First Indian made model with liquid cooled Engine. Liquid Cooled Engine provide stable performance, reduce vibrations, and offer a high quality ride. The engine is surrounded by a water jacket in which coolant liquid circulates to cool the engine. While this method is widely used in automobiles and large capacity motorcycles, there are very few examples of motorcycles of this class due to increased weight from components such as radiators. YZF-R15 version 2.0 uses a special compact and lightweight aluminium radiator and a body design that utilizes airflow for heat dissipation. This has enabled us to create a lightweight, compact body while retaining its stable performance.", "brand": "yamaha", "model": "YZFR15V2", "color": "Blue Streaking Cyan Raring Red Invincible Black"},
{"url": "http://yamaha.lk/"},
{"url": "http://yamaha.lk/Default.aspx"},
{"url": "http://yamaha.lk/R3.aspx", "engine": "A newly developed 320.6cc, liquid-cooled, 4-stroke, in-line 2-cylinder, 4-valve fuel-injected engine that achieves the model's concept is adopted. With a bore x stroke specification of 68.0 mm 44.1 mm and a compression ratio of 11.2:1, this engine generates its maximum power output at 10,750 rpm and maximum torque at 9,000 rpm. prominent feature of this newly designed engine is that it employs the latest combustion analysis technology to ensure a sufficient volume of air-fuel mixture intake and actively inducing a swirl and tumble flow as it enters the combustion chamber to promote rapid combustion.", "brand": "yamaha", "model": "R3", "color": "Racing Blue  Magma Black"},
{"url": "http://yamaha.lk/SpareDealers.aspx"},
{"url": "http://yamaha.lk/News.aspx"},
{"url": "http://yamaha.lk/ContactUs.aspx"},
{"url": "http://yamaha.lk/SalesEnquiry.aspx"}
]